// 尝试在这里整一个可以显示的全加器出来
// 首先是按钮映射关系

/*
* s1 PIN_L3 
* s2 PIN_L1
* s3 PIN_J6
* s4 PIN_N1
*/

// 这里的都是低电平有效，都有上拉，按下为0，不按被上拉到1

// 然后是4个LED

/*                                                                               
 ┌─────────────────────┬──────────────────────┬───────────┬──────────┐                                                                                        
 │ 板载 LED            │ 网络（原理图 D3–D6） │ FPGA 管脚 │ 例程信号 │                                                                                        
 ├─────────────────────┼──────────────────────┼───────────┼──────────┤                                                                                        
 │ LED1（D3，第 1 个） │ LED1                 │ PIN_T12   │ LED[0]   │                                                                                        
 ├─────────────────────┼──────────────────────┼───────────┼──────────┤                                                                                        
 │ LED2（D4）          │ LED2                 │ PIN_P8    │ LED[1]   │                                                                                        
 ├─────────────────────┼──────────────────────┼───────────┼──────────┤                                                                                        
 │ LED3（D5）          │ LED3                 │ PIN_M8    │ LED[2]   │                                                                                        
 ├─────────────────────┼──────────────────────┼───────────┼──────────┤                                                                                        
 │ LED4（D6，第 4 个） │ LED4                 │ PIN_M10   │ LED[3]   │                                                                                        
 └─────────────────────┴──────────────────────┴───────────┴──────────┘                                                    */

// 这里的都是低电平点亮

// 接着是数码管

/*
 ┌───────────┬────────┬─────────────────┐                                                                                                                     
 │ FPGA 管脚 │ 信号   │ 说明            │                                                                                                                     
 ├───────────┼────────┼─────────────────┤                                                                                                                     
 │ PIN_T11   │ seg[0] │ 段 a            │                                                                                                                     
 ├───────────┼────────┼─────────────────┤                                                                                                                     
 │ PIN_T10   │ seg[1] │ 段 b            │                                                                                                                     
 ├───────────┼────────┼─────────────────┤                                                                                                                     
 │ PIN_T9    │ seg[2] │ 段 c            │                                                                                                                     
 ├───────────┼────────┼─────────────────┤                                                                                                                     
 │ PIN_T8    │ seg[3] │ 段 d            │                                                                                                                     
 ├───────────┼────────┼─────────────────┤                                                                                                                     
 │ PIN_T7    │ seg[4] │ 段 e            │                                                                                                                     
 ├───────────┼────────┼─────────────────┤                                                                                                                     
 │ PIN_T6    │ seg[5] │ 段 f            │                                                                                                                     
 ├───────────┼────────┼─────────────────┤                                                                                                                     
 │ PIN_T5    │ seg[6] │ 段 g            │                                                                                                                     
 ├───────────┼────────┼─────────────────┤                                                                                                                     
 │ PIN_T4    │ seg[7] │ 段 DP（最高位） │                                                                                                                     
 ├───────────┼────────┼─────────────────┤                                                                                                                     
 │ PIN_M7    │ sel[0] │ 74HC138 A       │                                                                                                                     
 ├───────────┼────────┼─────────────────┤                                                                                                                     
 │ PIN_N6    │ sel[1] │ 74HC138 B       │                                                                                                                     
 ├───────────┼────────┼─────────────────┤                                                                                                                     
 │ PIN_L6    │ sel[2] │ 74HC138 C       │                                                                                                                     
 └───────────┴────────┴─────────────────┘ 

 */

module BassttAdder (
    input   wire         clk,
    input   wire  [3:0]  keys,
//    output  wire  [7:0]  segs
//    output  wire  [2:0]  sels,
    output  wire  [3:0]  leds
);

wire [3:0] keys_with_debounced_output;

input_stage u_input_stage (

    .clk            (clk),
    .sws            (keys),
    .sws_output     (keys_with_debounced_output)

);

leds_displayer u_leds_displayer (

    .clk            (clk),
    .leds_input     (keys_with_debounced_output),
    .leds_output    (leds)

);

endmodule
